// 📌 DESCRIPTION:
// Первый входной массив — это ключ к правильным ответам на экзамен, например ["a", "a", "b", "d"].
// Второй содержит отправленные ответы студента.
//
// Два массива не пустые и имеют одинаковую длину.
// Верните оценку для этого массива ответов,
// указав +4для каждого правильного ответа, -1для каждого неправильного ответа и +0для каждого пустого ответа,
// представленного в виде пустой строки (в C используется символ пробела).
//
// Если оценка < 0, вернуть 0.
//
// Например:
//
//     Correct answer    |    Student's answer   |   Result
//   ------------------- |-----------------------|-----------
//   ["a", "a", "b", "b"]   ["a", "c", "b", "d"]  →     6
//   ["a", "a", "c", "b"]   ["a", "a", "b", "" ]  →     7
//   ["a", "a", "b", "c"]   ["a", "a", "b", "c"]  →     16
//   ["b", "c", "b", "a"]   ["" , "a", "a", "c"]  →     0

//✅ SOLUTTION:
function checkExam(array1, array2) {
  let result = 0;
  for (let i = 0, j = 0; i < array1.length, j < array2.length; i++, j++) {
    if (array2[j] === array1[i]) {
      result += 4;
    } else if (array2[j] === ``) {
      result += 0;
    } else {
      result -= 1;
    }
  }
  return result < 0 ? 0 : result;
}

console.log(checkExam(["b", "c", "b", "a"], ["", "a", "a", "c"]));
console.log(checkExam(["a", "a", "b", "c"], ["a", "a", "b", "c"]));
